In [1]:
import pandas as pd
import numpy as np

In [18]:
# To typecast to pandas
# series is 1D object
s = pd.Series([1,2,3,4,5])
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [19]:
print(s[2])

3

In [20]:
print(s[1:3])

1    2
2    3
dtype: int64

In [22]:
s = pd.Series(['x','y','z','Tfa'])
print(s)

0      x
1      y
2      z
3    Tfa
dtype: object

# Creating Series from Numpy ndarray

In [24]:
# arrays to pandas by typecasting

data = np.array([10,20,30,40,50])
print(data)
s = pd.Series(data)
print(s)

[10 20 30 40 50]
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [25]:
data = np.array([[1,2,3],[4,5,6]])

s = pd.Series(data)
print(s)

ValueError: Data must be 1-dimensional

In [16]:
# DataFrame - collection of series(columns) ; 2D object

s = pd.DataFrame([1,2,3,4,5])
print(s)
print('*'*40)
s = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15]])
print(s)

   0
0  1
1  2
2  3
3  4
4  5
****************************************
    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15

# Data accessing using index

In [28]:
s = pd.Series([1,2,3,4,5])

print(s[2])
print('*'*40)
print(s[1:])
print('*'*40)
print(s[[1,4]])
print('*'*40)
print(s[1,4])

3
****************************************
1    2
2    3
3    4
4    5
dtype: int64
****************************************
1    2
4    5
dtype: int64
****************************************

KeyError: 'key of type tuple not found and not a MultiIndex'

In [30]:
s = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
print(s)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [32]:
print(s['d'])

4

In [33]:
print(s['b':])

b    2
c    3
d    4
e    5
dtype: int64

In [35]:
print(s[['a','c','e']])

a    1
c    3
e    5
dtype: int64

In [36]:
print(s['f'])

KeyError: 'f'

In [2]:
import pandas as pd
s = pd.Series(['potatoes are "great"', 'they are'])
s

0    potatoes are "great"
1                they are
dtype: object

In [3]:
s.str.replace('"', '')

0    potatoes are great
1              they are
dtype: object

# Pandas DataFrame

Creating DataFrame using Dictionary

In [2]:
data = {'Name':['Tom','Jack','Steve','Ricky'], 'Age':[28,34,56,25]}
df = pd.DataFrame(data)
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   56
3  Ricky   25

In [53]:
print(df)

    Name  Age
a    Tom   28
b   Jack   34
c  Steve   56
d  Ricky   25

In [4]:
print(df.Age)

0    28
1    34
2    56
3    25
Name: Age, dtype: int64

In [58]:
#Creating indexed DataFrame

data = {'Name': ['Tom','Jack','Steve','Ricky'],
        'Age' : [28,34,25,56],
        'Gender': ['Male','Female','Female','Male']}
df = pd.DataFrame(data,index=['I-1','I-2','I-3','I-4'])
df

      Name  Age  Gender
I-1    Tom   28    Male
I-2   Jack   34  Female
I-3  Steve   25  Female
I-4  Ricky   56    Male

In [59]:
print(df)

      Name  Age  Gender
I-1    Tom   28    Male
I-2   Jack   34  Female
I-3  Steve   25  Female
I-4  Ricky   56    Male

In [69]:
df = pd.DataFrame({
    'col-1':['Item-1', 'Item-2', 'Item-3', 'Item-4'],
    'col-2':['Gold', 'Bronze', 'Gold', 'Silver'],
    'col-3':[1,2,np.nan,4]
    })
df

    col-1   col-2  col-3
0  Item-1    Gold    1.0
1  Item-2  Bronze    2.0
2  Item-3    Gold    NaN
3  Item-4  Silver    4.0

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col-1   4 non-null      object
 1   col-2   4 non-null      object
 2   col-3   3 non-null      float64
dtypes: float64(1), object(2)
memory usage: 224.0+ bytes

In [73]:
df = pd.DataFrame({
    'col-1':['Item-1', 'Item-2', 'Item-3', 'Item-4'],
    'col-2':['Gold', 'Bronze', 'Gold', 'Silver'],
    'col-3':[1,2,np.nan,' ']
    })
df

    col-1   col-2 col-3
0  Item-1    Gold     1
1  Item-2  Bronze     2
2  Item-3    Gold   NaN
3  Item-4  Silver

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col-1   4 non-null      object
 1   col-2   4 non-null      object
 2   col-3   3 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

# Creating DataFrame using tuple

In [79]:
data = [('1/1/2019', 13, 6, 'Rain'),
        ('2/1/2019', 11, 7, 'Fog'),
        ('3/1/2019', 12, 8, 'Sunny'),
        ('4/1/2019',  8, 9, 'Snow'),
        ('5/1/2019',  9, 6, 'Rain')]
df = pd.DataFrame(data, columns=['Day','Temperature','WindSpeed','Event'],
                        index=['r->1','r->2','r->3','r->4','r->5'])
#df = pd.DataFrame(data)
df

           Day  Temperature  WindSpeed  Event
r->1  1/1/2019           13          6   Rain
r->2  2/1/2019           11          7    Fog
r->3  3/1/2019           12          8  Sunny
r->4  4/1/2019            8          9   Snow
r->5  5/1/2019            9          6   Rain

# DataFrame basic functionality

In [115]:
#Creating Dictionary of Series

dict = {'Name':pd.Series(['Tom','Jack','Steve','Ricky','Vin','James','Vin']),
        'Age ':pd.Series([25,36,54,23,54,43,31]),
        'rating':pd.Series([4.23,4.1,3.4,5,2.9,4.7,3.1])}
df = pd.DataFrame(dict)
df

    Name  Age   rating
0    Tom    25    4.23
1   Jack    36    4.10
2  Steve    54    3.40
3  Ricky    23    5.00
4    Vin    54    2.90
5  James    43    4.70
6    Vin    31    3.10

In [116]:
#dict1 = {'Name':pd.Series(['Tom','Jack','Ricky','Vin','James','Vin']),
#        'Age ':pd.Series([25,36,54,23,54,43]),
#        'rating':pd.Series([4.23,4.1,3.4,5,2.9,4.7,3.1])}
#df = pd.Series(dict1)
#df

In [117]:
df.columns

Index(['Name', 'Age ', 'rating'], dtype='object')

In [118]:
#Transpose --> returns transpose of DataFrame
df.T

           0     1      2      3    4      5    6
Name     Tom  Jack  Steve  Ricky  Vin  James  Vin
Age       25    36     54     23   54     43   31
rating  4.23   4.1    3.4    5.0  2.9    4.7  3.1

In [119]:
df.columns

Index(['Name', 'Age ', 'rating'], dtype='object')

In [120]:
df

    Name  Age   rating
0    Tom    25    4.23
1   Jack    36    4.10
2  Steve    54    3.40
3  Ricky    23    5.00
4    Vin    54    2.90
5  James    43    4.70
6    Vin    31    3.10

In [121]:
#dtypes -> return datatype of each column
df.dtypes

Name       object
Age         int64
rating    float64
dtype: object

In [122]:
# shape -> returns tuple representing dimensionally
df.shape

(7, 3)

In [123]:
# axes -> returns list of row axis lables and column axis lables
df.axes

[RangeIndex(start=0, stop=7, step=1),
 Index(['Name', 'Age ', 'rating'], dtype='object')]

In [124]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   rating  7 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 296.0+ bytes

In [125]:
# values -> returns actual data as ndarray
df.values

array([['Tom', 25, 4.23],
       ['Jack', 36, 4.1],
       ['Steve', 54, 3.4],
       ['Ricky', 23, 5.0],
       ['Vin', 54, 2.9],
       ['James', 43, 4.7],
       ['Vin', 31, 3.1]], dtype=object)

In [127]:
#head -> by default head return first 5 rows
df.head()

    Name  Age   rating
0    Tom    25    4.23
1   Jack    36    4.10
2  Steve    54    3.40
3  Ricky    23    5.00
4    Vin    54    2.90

In [131]:
df.head(2)

   Name  Age   rating
0   Tom    25    4.23
1  Jack    36    4.10

In [128]:
#head -> by default head return last 5 rows
df.tail()

    Name  Age   rating
2  Steve    54     3.4
3  Ricky    23     5.0
4    Vin    54     2.9
5  James    43     4.7
6    Vin    31     3.1

In [132]:
df.tail(2)

    Name  Age   rating
5  James    43     4.7
6    Vin    31     3.1

# Statistics

In [133]:
df

    Name  Age   rating
0    Tom    25    4.23
1   Jack    36    4.10
2  Steve    54    3.40
3  Ricky    23    5.00
4    Vin    54    2.90
5  James    43    4.70
6    Vin    31    3.10

In [134]:
# sum -> returns the sum of values for requested axis, by default axis = 0 (column wise sum)
df.sum()

Name      TomJackSteveRickyVinJamesVin
Age                                266
rating                           27.43
dtype: object

In [137]:
# sum(1) -> column wise sum
df.sum(1)

0    29.23
1    40.10
2    57.40
3    28.00
4    56.90
5    47.70
6    34.10
dtype: float64

In [138]:
# mean

df.mean()

Age       38.000000
rating     3.918571
dtype: float64

In [139]:
# std --> defines spread of the data -> how the data is spreading

df.std()

Age       12.806248
rating     0.804828
dtype: float64

In [140]:
# describe  -> summarizing the data

df.describe()

            Age     rating
count   7.000000  7.000000
mean   38.000000  3.918571
std    12.806248  0.804828
min    23.000000  2.900000
25%    28.000000  3.250000
50%    36.000000  4.100000
75%    48.500000  4.465000
max    54.000000  5.000000

In [141]:
 # include object, number, all

print(df.describe(include=['object']))

       Name
count     7
unique    6
top     Vin
freq      2

In [142]:
print(df.describe(include=['number']))

            Age     rating
count   7.000000  7.000000
mean   38.000000  3.918571
std    12.806248  0.804828
min    23.000000  2.900000
25%    28.000000  3.250000
50%    36.000000  4.100000
75%    48.500000  4.465000
max    54.000000  5.000000

In [145]:
# Don't pass 'all' as a list

print(df.describe(include='all'))

       Name       Age     rating
count     7   7.000000  7.000000
unique    6        NaN       NaN
top     Vin        NaN       NaN
freq      2        NaN       NaN
mean    NaN  38.000000  3.918571
std     NaN  12.806248  0.804828
min     NaN  23.000000  2.900000
25%     NaN  28.000000  3.250000
50%     NaN  36.000000  4.100000
75%     NaN  48.500000  4.465000
max     NaN  54.000000  5.000000